/*****************************************
* 파일 이름 : main.c
* 설명       : 두수의 합을 구하는 프로그램입니다
* 작성자     : 김종선
* 작성일자   : 2023 . 03 . 08
*****************************************/

#include <stdio.h>                       // 전처리 header file

int main(void)                           // 메인 함수 

{
	int x;   int y;   int sum;   //int x, y, sum;       // 변수 (variable) 선언 (define)
	                                                    // 변하지 않는수는 상수 
	////////////////////// 덧셈 ///////////////////////
	x = 100;   y = 200;  sum = x + y;  // 연산
	printf("두수의 합: %d\n", sum);
	///////////////////// 뺄셈 ///////////////////////
	x = 100;   y = 200;  sum = x - y;
	printf("두수의 차: %d\n", sum);
	///////////////////// 곱셈 ////////////////////////
	x = 100;   y = 200;  sum = x * y;
		printf("두수의 곱: %d\n", sum);
	/// //////////////// 나눗셈 ////////////////////////
		x = 100;   y = 200;  sum = x / y;
	printf("두수의 나누기: %d\n", sum);    // 출력

	/// //////////////// 나머지 ////////////////////////
	x = 7; y = 3; sum = x % y;
	printf("x에 y를 나눈 나머지: %d\n" , sum);



	return 0;                           // 함숫값 반환
}